src/test/performance/result_bloq.txt
Phase started: unnamed (index: 0, duration: 1s) 16:04:42(-0300)

Phase completed: unnamed (index: 0, duration: 1s) 16:04:43(-0300)

--------------------------------------
Metrics for period to: 16:04:50(-0300) (width: 5.612s)
--------------------------------------

http.codes.200: ................................................................ 1000
http.request_rate: ............................................................. 179/sec
http.requests: ................................................................. 1000
http.response_time:
  min: ......................................................................... 7
  max: ......................................................................... 192
  median: ...................................................................... 89.1
  p95: ......................................................................... 153
  p99: ......................................................................... 183.1
http.responses: ................................................................ 1000
vusers.completed: .............................................................. 20
vusers.created: ................................................................ 20
vusers.created_by_name.0: ...................................................... 20
vusers.failed: ................................................................. 0
vusers.session_length:
  min: ......................................................................... 3851.8
  max: ......................................................................... 4882.9
  median: ...................................................................... 4770.6
  p95: ......................................................................... 4867
  p99: ......................................................................... 4867


All VUs finished. Total time: 7 seconds

--------------------------------
Summary report @ 16:04:50(-0300)
--------------------------------

http.codes.200: ................................................................ 1000
http.request_rate: ............................................................. 179/sec
http.requests: ................................................................. 1000
http.response_time:
  min: ......................................................................... 7
  max: ......................................................................... 192
  median: ...................................................................... 89.1
  p95: ......................................................................... 153
  p99: ......................................................................... 183.1
http.responses: ................................................................ 1000
vusers.completed: .............................................................. 20
vusers.created: ................................................................ 20
vusers.created_by_name.0: ...................................................... 20
vusers.failed: ................................................................. 0
vusers.session_length:
  min: ......................................................................... 3851.8
  max: ......................................................................... 4882.9
  median: ...................................................................... 4770.6
  p95: ......................................................................... 4867
  p99: ......................................................................... 4867