src/test/performance/result_nobloq.txt
Phase started: unnamed (index: 0, duration: 1s) 16:03:29(-0300)

Phase completed: unnamed (index: 0, duration: 1s) 16:03:30(-0300)

--------------------------------------
Metrics for period to: 16:03:30(-0300) (width: 0.108s)
--------------------------------------

http.codes.200: ................................................................ 21
http.request_rate: ............................................................. 23/sec
http.requests: ................................................................. 23
http.response_time:
  min: ......................................................................... 2
  max: ......................................................................... 27
  median: ...................................................................... 3
  p95: ......................................................................... 7.9
  p99: ......................................................................... 7.9
http.responses: ................................................................ 21
vusers.created: ................................................................ 3
vusers.created_by_name.0: ...................................................... 3


--------------------------------------
Metrics for period to: 16:03:40(-0300) (width: 1.562s)
--------------------------------------

http.codes.200: ................................................................ 979
http.request_rate: ............................................................. 627/sec
http.requests: ................................................................. 977
http.response_time:
  min: ......................................................................... 1
  max: ......................................................................... 51
  median: ...................................................................... 13.9
  p95: ......................................................................... 30.9
  p99: ......................................................................... 40
http.responses: ................................................................ 979
vusers.completed: .............................................................. 20
vusers.created: ................................................................ 17
vusers.created_by_name.0: ...................................................... 17
vusers.failed: ................................................................. 0
vusers.session_length:
  min: ......................................................................... 468.2
  max: ......................................................................... 1001.6
  median: ...................................................................... 871.5
  p95: ......................................................................... 1002.4
  p99: ......................................................................... 1002.4


All VUs finished. Total time: 3 seconds

--------------------------------
Summary report @ 16:03:33(-0300)
--------------------------------

http.codes.200: ................................................................ 1000
http.request_rate: ............................................................. 325/sec
http.requests: ................................................................. 1000
http.response_time:
  min: ......................................................................... 1
  max: ......................................................................... 51
  median: ...................................................................... 13.9
  p95: ......................................................................... 30.9
  p99: ......................................................................... 40
http.responses: ................................................................ 1000
vusers.completed: .............................................................. 20
vusers.created: ................................................................ 20
vusers.created_by_name.0: ...................................................... 20
vusers.failed: ................................................................. 0
vusers.session_length:
  min: ......................................................................... 468.2
  max: ......................................................................... 1001.6
  median: ...................................................................... 871.5
  p95: ......................................................................... 1002.4
  p99: ......................................................................... 1002.4